const letters = ["Ā̵͕̩̓̒̊̕̚͝", "̸̧̛̥̙̖̭͆̽͗̀̑̿̒̀̕Ḇ̸̞̅̾", "̷̘͕̫̜̘̊̍͘̕C̷̡̬̣̀̀̆̃̈́͊̕͝", "̷̧̣̮̼͍̺̻̯̝̍́D̴̨̛̥͎̗͍̫̣͍͕̔̓̈́͋̌̀̔̕͠", "̴̦̣̃̌͋̓̅E̴̩͎̜͈̳̺̤̣̾̔̋̑͊͜", "̵̢̺̈́̄̂F̶̗̝̗̫͒͂ͅ", "̷̤̺̄͗̃͌͒̈́̈͌̓̿ͅG̶̞͉̦̣͉̟͇̣̣̜̒̿̃͛̚̕", "̷̧̙͎̗́͐̚H̷͖͇̋̈́̾̃͆͌̇̓̀", "̷̛͔̅̾͐̆͊̈́I̸̩̥̻̱̩͖̤͕͗͝ͅ", "̷̗̝͕̈́̀̍̈́͑̍͘͝J̸̧̣̙̭̤̬̙̗̅̓͑̈͛̋̽̄͝", "̸̨͖̖̹͕̂͂́̄̀̐̿̃͂͘ͅK̵̠̖̯͇̖̠̻̓̓̌̈́͑̓̅̇ͅ", "̷̗̰͙̭̘͗͑̏̿̂̈́͘L̷̡̜͇̞̣̳̓͐̂̆́̚͜͜", "̸͕͉͈̙̥̦͍̰̰̀͋̅̇̎̓M̶̡̪̤̲̯̗̓̈́̑̒̄̀͜", "̶̡̛̹̫̙̞̊̏́͆̽̕N̸̬̤̖͉̗̗̯͔̄", "̸͍͖͎̦͈̂̄̆̈́̔̇̐̚͘̚Ȯ̴̠̪̫̙͓͈̟̞̋̅̽̆͐͗̕͜", "̷̥͕̻͇̐̉̅͂̈́͛͝P̶̠͚͖͙̹̝̥͑̊̀͐̚͜͝", "̴̡͙̩̯̖̰̹̎̽̔Q̵̪̣̊͊͋̇͝", "̸̣̝͎̆̋͒̋R̴̨̨̛̲̩͉͉͓͆̉͐̒͊̌ͅ", "̷͔̓Ś̷̢͚̬̞̮͈̮̱̭͐́͘ͅ", "̴̨̝̖̆̋͆̓͆͒͠͠͠͠T̶̨̛̪̗̾͘", "̷̤͚͕̯̮̤̯̱̩̭̐̇̃̔̋͑Ṳ̵̡̺̮̩͊͝", "̵̨̧̙̫̱́͂̔̌̄̈͌͂̋̿V̵̮̹̽̓͆̐", "̴̖̿̈́̇͆̒̕͘W̷̨̡̱̺̪̤̏̾̀̈͘", "̶̢̟̭̜͇̜̐̅́͐X̴̯̟̠͇̗̗̳̳͔̉̉͋͆͠", "̴̧̬͈̻̣̖͊́Ý̴̡̨̡̭̯͖̖̞̒͒̀͋̀̈́̕̚͜ͅ", "̴͇̝͕͙͎̰͔̖̀̀̔Z̸̨̩̰͍̖̥̈̍"];
const numbers = ["̶̖̞̽͋͛̕0̸͇̜̥̲̥̗̫̫̀͆̓́̅̃̒", "̷̡̛͍̯͔̟͕̼̀͐̊͊̀̉͠1̷͇͕̆̉͒͜͝", "̶̰̥͙͕̗̋̂2̷̦͈̬̻͑̌̿͑̀̂̚͠", "̶̛̥̯̺̈́͐̎͛̀̈́̈́͝3̷̦̻͔͑͝ͅ", "̶̛̻̤̺̋̓͒͂̐̚4̴͔̗̀̈̇̀̉̿̐͝", "̴̛̞̜̫̲̲̲̗̍̄̌̄̾̂̒̚5̶̨̬̮̣̘͔̞̫̇̚", "̵̛̹̙̻̪̺̫̓̉̾̀̂6̴̧̡͎̞͖̝̫͉̙̒̊͑̄͠", "̷̧̣̻̠̪̹͈͓̙̀̀̈͊́̈7̶̧͍͔̔̂͗̊̾̋̆ͅ", "̴̧̖̪͇̜̔̎̋̃̽̑̈̚͘͜͝ͅ8̶̤̞̗̘͖̘̗̦̄͆͑̓̿̑̔͛", "̴̜͋̀9̸̲̓̀"];

const path = await import("path");
const cwd = process.cwd();
const { save, load, file } = await import(path.join(cwd, "database", "index.js"));
const { permissions, errors } = await import(path.join(cwd, "utils", "constants.js"));


export default {
    permission: permissions.member,
    code: async (msg, argstring, config) => {
        return argstring
            .split("")
            .map((char) => {
                if (/([a-zA-Z])/.test(char)) {
                    return letters[
                        char.toLowerCase().charCodeAt(0) - 97
                    ];
                } else if (/([0-9])/.test(char)) {
                    return numbers[char];
                } else return char;
            })
            .join("")
    },
    help: `
    Usage: \`curse [text to curse]\`.
    
    Returns all text behind the command, but stylized ̷͗͘L̷̓͐I̸͗͝K̵̓̓E̴̾̔ ̴̆͠T̶̛̾H̷̋̈́I̸͗͝Ś̷͐.
    `
}